tutorials/chtMultiRegionFoam/multiRegionHeater/system/changeDictionaryDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/warhol/chris/foam/chris2.1/run/tutorials/interFoam";
    case            "damBreak";
    instance        "system";
    local           "";

    class           dictionary;
    object          changePatchTypeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement
{
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            minY
            {
                type            fixedValue;
                value           uniform 500;
            }

            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }

            heater_to_domain0
            {
                type            solidWallHeatFluxTemperatureCoupled;
                neighbourRegionName domain0;
                neighbourPatchName domain0_to_heater;
                neighbourFieldName T;
                K               K;
                value           uniform 300;

            }
            heater_to_solid1
            {
                type            solidWallHeatFluxTemperatureCoupled;
                neighbourRegionName solid1;
                neighbourPatchName solid1_to_heater;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
            heater_to_solid3
            {
                type            solidWallHeatFluxTemperatureCoupled;
                neighbourRegionName solid3;
                neighbourPatchName solid3_to_heater;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
            heater_to_domain3
            {
                type            solidWallHeatFluxTemperatureCoupled;
                neighbourRegionName domain3;
                neighbourPatchName domain3_to_heater;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            minY
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            heater_to_domain0
            {
                type            zeroGradient;
            }
            heater_to_solid1
            {
                type            zeroGradient;
            }
            heater_to_solid3
            {
                type            zeroGradient;
            }
            heater_to_domain3
            {
                type            zeroGradient;
            }
        }
    }


    K
    {
        internalField   uniform 80;

        boundaryField
        {
            minY
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            heater_to_domain0
            {
                type            zeroGradient;
            }
            heater_to_solid1
            {
                type            zeroGradient;
            }
            heater_to_solid3
            {
                type            zeroGradient;
            }
            heater_to_domain3
            {
                type            zeroGradient;
            }
        }
    }


    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            minY
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            heater_to_domain0
            {
                type            zeroGradient;
            }
            heater_to_solid1
            {
                type            zeroGradient;
            }
            heater_to_solid3
            {
                type            zeroGradient;
            }
            heater_to_domain3
            {
                type            zeroGradient;
            }
        }
    }
}

// ************************************************************************* //
